OpenDTEF-v1812/tutorials/multiphase/interIsoFoam/discInReversedVortexFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         8;

writeControl    adjustableRunTime;

writeInterval   0.1;

deltaT          0.002;

purgeWrite      0;

writeFormat     binary;

writePrecision  14;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           1e10;
maxAlphaCo      0.5;

maxDeltaT       0.05;

functions
{
    setVelocity
    {
        type            setFlow;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        mode            vortex2D;
        scale           sine;
        scaleCoeffs
        {
            amplitude       1;
            frequency       0.0625; // = 1/16
            t0              -4;     // want cos -> time shift = -(pi/2)/(2 pi f)
            scale           1;
            level           0;
        }
        origin          (0 0 0);
        refDir          (1 0 0);
        axis            (0 1 0);
    }
}


// ************************************************************************* //
